; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared1 - mode
	spectrograph3 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star10 - direction
	Star13 - direction
	GroundStation11 - direction
	GroundStation9 - direction
	GroundStation8 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation12 - direction
	GroundStation14 - direction
	Star4 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation12)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 GroundStation12)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Planet15 spectrograph2)
	(have_image Star16 infrared1)
	(have_image Planet17 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation12 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 groundstation12)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 4
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
5. (calibrate satellite1 instrument3 groundstation12)
   added: (calibrated instrument3)
   goals met: 0 of 4
6. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 4
7. (turn_to satellite0 star16 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star16)
   goals met: 0 of 4
8. (take_image satellite0 star16 instrument1 infrared1)
   added: (have_image star16 infrared1)
   goals met: 1 of 4
9. (turn_to satellite1 planet15 groundstation12)
   deleted: (pointing satellite1 groundstation12)
   added: (pointing satellite1 planet15)
   goals met: 1 of 4
10. (take_image satellite1 planet15 instrument3 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 2 of 4
11. (turn_to satellite1 planet17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet17)
   goals met: 2 of 4
12. (take_image satellite1 planet17 instrument3 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 3 of 4
13. (turn_to satellite1 groundstation2 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 groundstation2)
   goals met: 4 of 4
